#pragma once

#include "CoreMinimal.h"
#include "GameFramework/PlayerController.h"
#include "Mordhau.h"
#include "DummyActor.h"
#include "MordhauPlayerController.generated.h"

/**
 *
 */
UCLASS()
class MORDHAU_API AMordhauPlayerController : public APlayerController
{
	GENERATED_BODY()

public:
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		TWeakObjectPtr<class APawn>                        LastPawn;                                                 // 0x067C(0x0008) (ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		class UTagSystemComponent*                         TagSystemComponent;                                       // 0x06D8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		struct FScriptMulticastDelegate                    OnServerRestrictionInfoReceived;                          // 0x06E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		float                                              TotalMordhauCharacterTeamDamage;                          // 0x06F0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		float                                              TotalMordhauCharacterDamage;                              // 0x06F4(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		bool                                               bIsAnythingRestockable;                                   // 0x06F8(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		int                                                SelectedCharacterProfile;                                 // 0x06FC(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		int                                                SelectedDefaultProfile;                                   // 0x0700(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		struct FCharacterProfile                           CharacterProfile;                                         // 0x0708(0x00B8) (BlueprintVisible, BlueprintReadOnly)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		bool                                               bReceivedValidProfileFromClient;                          // 0x07C0(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		float                                              LastAskedForSpawnTime;                                    // 0x07C4(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		int                                                SpawnToken;                                               // 0x07C8(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		struct FCharacterProfile                           LastSentCharacterProfile;                                 // 0x07D8(0x00B8)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		class ACustomizationReplicationActor*              CustomizationReplicationActor;                            // 0x0898(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		bool                                               bSendsDefaultCustomization;                               // 0x08A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		TArray<struct FEquipmentCustomization>             DefaultCharacterEquipment;                                // 0x08A8(0x0010) (BlueprintVisible, ZeroConstructor)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		TArray<struct FCharacterGearCustomization>         DefaultCharacterTier;                                     // 0x08C8(0x0010) (BlueprintVisible, ZeroConstructor)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		struct FCharacterProfile                           PendingCharacterProfile;                                  // 0x08E0(0x00B8) (BlueprintVisible)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		bool                                               bIsPendingCharacterProfileASelectedDefaultProfile;        // 0x0998(0x0001) (ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		struct FCharacterProfile                           ConstructingCharacterProfile;                             // 0x09A0(0x00B8)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		TWeakObjectPtr<class AMordhauCharacter>            LastControlledCharacter;                                  // 0x0A5C(0x0008) (ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		float                                              NextRespawnTime;                                          // 0x0AB8(0x0004) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		bool                                               bUseInstancing;                                           // 0x0ABE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		float                                              LocallyTrackedObjectiveScore;                             // 0x0B10(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		bool                                               bWantsBlockInput;                                         // 0x0B14(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		float                                              MaxAFKTime;                                               // 0x0B18(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		bool                                               bOnlyAFKIfAlive;                                          // 0x0B1C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		float                                              CurrentAFKTime;                                           // 0x0B20(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		struct FVector                                     LastAFKCheckCameraLocation;                               // 0x0B24(0x000C) (IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		bool                                               bIsAuthenticated;                                         // 0x0B30(0x0001) (ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		bool                                               bClientRequestedRewards;                                  // 0x0B31(0x0001) (ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		bool                                               bServerReceivedRewards;                                   // 0x0B32(0x0001) (ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		int                                                RewardedGold;                                             // 0x0B34(0x0004) (ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		int                                                RewardedXP;                                               // 0x0B38(0x0004) (ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		struct FServerStats                                ServerStats;                                              // 0x0B3C(0x0018)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		TArray<FString>                             MapVoteMaps;                                              // 0x0B58(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		TArray<uint8>                              MapVoteCounts;                                            // 0x0B68(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		int                                                Rank;                                                     // 0x0B78(0x0004) (ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		FString                                     MatchmakingMatchID;                                       // 0x0B80(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
		struct FPlayerCommand CurrentPlayerCommand;                                     // 0x0B90(0x0030)

	UFUNCTION(BlueprintCallable, Category = "MordhauControllerFns")
		void VoteMap(const FString& MapName);
	UFUNCTION(BlueprintCallable, Category = "MordhauControllerFns")
		void VoteLevel(const FString& LevelName);
	UFUNCTION(BlueprintCallable, Category = "MordhauControllerFns")
		void VoteKick(const FString& PlayerNameOrPlayFabID);
	UFUNCTION(BlueprintCallable, Category = "MordhauControllerFns")
		void Unmute(const FString& PlayerNameOrPlayFabID);
	UFUNCTION(BlueprintCallable, Category = "MordhauControllerFns")
		void UnmountPak(const FString& PakPath);
	UFUNCTION(BlueprintCallable, Category = "MordhauControllerFns")
		void Unban(const FString& PlayFabId);
	UFUNCTION(BlueprintCallable, Category = "MordhauControllerFns")
		void Turn(float Value);
	UFUNCTION(BlueprintCallable, Category = "MordhauControllerFns")
		void ToggleStamina();
	UFUNCTION(BlueprintCallable, Category = "MordhauControllerFns")
		void ToggleServerNetProfile();
