// Fill out your copyright notice in the Description page of Project Settings.

#pragma once

#include "CoreMinimal.h"
#include "Camera/CameraComponent.h"
#include "MordhauCameraComponent.generated.h"

/**
 * 
 */
UCLASS(Blueprintable, meta = (BlueprintSpawnableComponent))
class MORDHAU_API UMordhauCameraComponent : public UCameraComponent
{
	GENERATED_BODY()
	
public:
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              MaxCameraCycleFrequency;                                  // 0x0800(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              FirstPersonLookUpOffset;                                  // 0x0804(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              AimingCameraActivateChangeSpeed;                          // 0x0808(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              AimingCameraDisableChangeSpeed;                           // 0x080C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              CinematicCameraBlendWeight;                               // 0x0814(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              MinimumCinematicCameraBlendWeight;                        // 0x0818(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FVector                                     FirstPersonCinematicCameraOffset;                         // 0x081C(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FVector                                     ThirdPersonCinematicCameraOffset;                         // 0x0828(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FRotator                                    CinematicCameraRotationOffset;                            // 0x0834(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              MaxThirdPersonFOV;                                        // 0x0840(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FRotator                                    ThirdPersonRotationOffset;                                // 0x0844(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FVector                                     ThirdPersonCameraOffset;                                  // 0x0850(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FRotator                                    ThirdPersonAimingCameraRotationOffset;                    // 0x085C(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FVector                                     ThirdPersonAimingCameraOffset;                            // 0x0868(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              ThirdPersonHipsSmoothSpeed;                               // 0x0874(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FVector                                     ThirdPersonHipsSmoothLimits;                              // 0x0878(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              ThirdPersonTeleportThreshold;                             // 0x0884(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              DeadCameraLocationSmoothSpeed;                            // 0x0888(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              DeadCameraLocationSmoothMaxDistance;                      // 0x088C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              DeadCameraRotationSmoothSpeed;                            // 0x0890(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FVector                                     SmoothedHeadLocation;                                     // 0x0894(0x000C) (BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FRotator                                    SmoothedHeadRotation;                                     // 0x08A0(0x000C) (BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FTransform                                  PreviousHeadTransform;                                    // 0x08B0(0x0030) (BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              TurnOnFirstPersonModelDistance;                           // 0x08E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              TurnOnThirdPersonModelDistance;                           // 0x08E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	class UCurveFloat*                                 ThirdToFirstBlendCurve;                                   // 0x08E8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	class UCurveFloat*                                 FirstToThirdBlendCurve;                                   // 0x08F0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	class UCurveFloat*                                 MapToFirstBlendCurve;                                     // 0x08F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	class UCurveFloat*                                 MapToThirdBlendCurve;                                     // 0x0900(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	class UCurveFloat*                                 MapToFirstRotationBlendCurve;                             // 0x0908(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	class UCurveFloat*                                 MapToThirdRotationBlendCurve;                             // 0x0910(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	uint8                                      CameraStyleBlendingFrom;                                  // 0x0918(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	uint8                                      CameraStyleBlendingTo;                                    // 0x0919(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FPOV                                        LastCameraStyleChangeCameraPOV;                           // 0x091C(0x001C) (BlueprintVisible)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FPOV                                        LastVehicleCameraPOV;                                     // 0x0938(0x001C) (BlueprintVisible)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FPOV                                        LastNonVehicleCameraPOV;                                  // 0x0954(0x001C) (BlueprintVisible)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FPOV                                        LastCameraPOV;                                            // 0x0970(0x001C) (BlueprintVisible)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	bool                                               bIsBlendingCameraStyle;                                   // 0x098C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              CameraStyleChangeBlendDuration;                           // 0x0990(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	float                                              MapCameraStyleChangeBlendDuration;                        // 0x0994(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FVector                                     SmoothedHipsOffset;                                       // 0x0998(0x000C) (BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FVector                                     PreviousHipsLocation;                                     // 0x09A4(0x000C) (BlueprintVisible, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	class UCurveFloat*                                 CameraFOVToLocationOffsetScaleCurve;                      // 0x09B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	UPROPERTY(BlueprintReadWrite, EditAnywhere)
	struct FVector                                     PreviousCharacterMeshLocation;                            // 0x09B8(0x000C) (IsPlainOldData)

	UFUNCTION(BlueprintCallable, BlueprintImplementableEvent, Category = "MordhauCamComponentFns")
	void UpdateCamera();
	UFUNCTION(BlueprintCallable, BlueprintImplementableEvent, Category = "MordhauCamComponentFns")
	struct FPOV ComputeCameraPOV();

};
